<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Adobe GoLive 6">
		<title>Das Datei-Men&uuml;</title>
	</head>

	<body bgcolor="#ffffff">
		<h3>Die Eintr&auml;ge im Dateimen&uuml;</h3>
		<blockquote>
			<p><a name="save"></a><i>speichern</i></p>
			<blockquote>
				<p>Der aktuelle Stand des Designs wird im internen .bin-Dateiformat gespeichert. Nicht verf&uuml;gbar in der Web-Version weil Designs im .bin-Format im allgemeinen zwischen verschiedenen Versionen des Routers nicht kompatibel sind. </p>
			</blockquote>
			<p><a name="save_and_exit"></a><i>speichern und beenden</i></p>
			<blockquote>
				<p>Das Programm wird beendet, nachdem der aktuelle Stand der Design-Datei im internen .bin-Format gespeichert wurde. Nicht verf&uuml;gbar in der Web-Version weil Designs im .bin-Format im allgemeinen zwischen verschiedenen Versionen des Routers nicht kompatibel sind.</p>
			</blockquote>
			<p><a name="cancel_and_exit"></a><i>abbrechen und beenden</i></p>
			<blockquote>
				<p>Das Programm wird beendet. Dabei werden alle interaktiven &Auml;nderungen nach dem letzten Speichern verworfen.</p>
			</blockquote>
			<p><a name="save_as"></a><i>speichern unter</i></p>
			<blockquote>
				<p>Hier k&ouml;nnen Sie den aktuellen Stand des Designs in einer Datei mit einem von Ihnen gew&auml;hlten Namen speichern. Erlaubt sind die Dateiendungen .bin und .dsn. Wenn Sie die Endung .bin w&auml;hlen, wird die Datei im internen Bin&auml;r-Format abgespeichert. Dabei wird der aktuelle interaktive Zustand des Programms mit abgespeichert. Da in  diesem Format abgespeicherte Designs i. a. mit einer sp&auml;teren Version der Software nicht mehr eingelesen werden k&ouml;nnen,  steht das .bin-Format nur in der Offline-Version des Routers zur Verf&uuml;gung. Wenn Sie m&ouml;chten, dass die abgespeicherte Design-Datei mit jeder sp&auml;teren Version der Software wieder eingelesen werden kann, m&uuml;ssen Sie die Dateiendung .dsn w&auml;hlen. Die Datei wird dann in einem Textformat abgespeichert, das eine Erweiterung des Specctra-dsn-Formats ist.</p>
			</blockquote>
			<p><a name="generate_logfile"></a><i>Log-Datei erzeugen</i></p>
			<blockquote>
				<p>Schreibt ab jetzt alle interaktiven Aktionen in eine Log-Datei, so dass diese Abfolge sp&auml;ter mit <i>Log-Datei abspielen</i> wiederholt werden kann. Es werden nur Aktionen abgespeichert, die eine Ver&auml;nderung des Designs zur Folge haben. Dieser Eintrag ist daf&uuml;r vorgesehen, kurze interaktive Abfolgen zum Debuggen wiederholbar zu machen. F&uuml;r die genaue Wiederholbarkeit l&auml;ngerer interaktiver Abfolgen wird keine Garantie &uuml;bernommen. Der Name einer solchen Log-Datei muss mit .log enden. Nicht verf&uuml;gbar in der Web-Version.</p>
			</blockquote>
			<p><a name="replay_logfile"></a><i>Log-Datei abspielen</i></p>
			<blockquote>
				<p>Die  Abfolge der Aktionen in einer mit <i>Log-Datei erzeugen </i>generierten Datei mit der Endung .log wird wiederholt. Das Design muss sich dabei im gleichen Zustand wie vor dem Erzeugen der Log-Datei befinden. Nicht verf&uuml;gbar in der Web-Version.</p>
			</blockquote>
			<p><a name="settings"></a><i>GUI-Einstellungen als Default speichern</i></p>
			<blockquote>
				<p>Die aktuellen interaktiven Einstellungen werden in einer Datei mit Namen gui_defaults.par abgespeichert.  In der Web-Version ist diese Datei im Java-Control-Panel-Cache versteckt. Sie k&ouml;nnen sie l&ouml;schen mit &quot;System-Defaults wiederherstellen&quot; im Startfenster des Routers. Wenn sp&auml;ter beim Einlesen eines Designs im .dsn-Format eine Datei mit Namen gui_defaults.par vorgefunden wird, werden die dort abgespeicherten Einstellungen wiederhergestellt. Damit k&ouml;nnen Sie design-unabh&auml;ngig Ihre pers&ouml;nlichen Vorlieben f&uuml;r die interaktiven Einstellungen abspeichern. Wenn Sie z. B. andere Objektfarben bevorzugen, oder wenn Sie zwei Bildschirme haben und die Position der Unterfenster auf den zweiten Bildschirm verlegen m&ouml;chten, brauchen Sie das nicht jedes mal neu einzustellen. Es empfiehlt sich, diese Abspeicherung auf einem Design mit m&ouml;glichst vielen Lagen vorzunehmen. Sonst w&uuml;rden sich die lagenabh&auml;ngigen Farben der einzelnen Objekttypen wiederholen, da die Datei gui_defaults.par aus einem Design mit weniger Lagen als dem aktuellen Design erzeugt wurde.</p>
			</blockquote>
			<p><a name="session_file"></a><i>Specctra-Session-Datei exportieren</i></p>
			<blockquote>
				<p>Um die mit dieser Software erzeugten &Auml;nderungen an der Design-Datei in das Host-System zur&uuml;ck zu &uuml;bertragen, k&ouml;nnen Sie hier k&ouml;nnen Sie eine Session-Datei im Specctra-.ses-Format schreiben. Diese Datei k&ouml;nnen Sie dann im Host-System so importieren, wie Sie das bei Verwendung des Specctra- oder des Electra-Autorouters machen w&uuml;rden. Nach dem Schreiben der Session-Datei werden Sie gefragt, ob Sie die in diesem Programm erzeugten Regeln zur sp&auml;teren Wiederverwendung speichern m&ouml;chten. Antworten Sie mit Ja, falls Sie z. B. Via-Regeln definiert haben, die Sie nach dem Hin- und Herwechseln zum Host-System und wieder zur&uuml;ck wieder verwenden wollen. Dabei k&ouml;nnen allerdings im Host-System neu definierte Regeln unter Umst&auml;nden &uuml;berschrieben werden.</p>
				<p>Wenn die urspr&uuml;ngliche Designdatei von Cadsoft-Eagle erzeugt wurde sehen Sie statt diesem Eintrag den folgenden Men&uuml;-Eintrag:</p>
			</blockquote>
			<p><a name="eagle_script"></a><i>Eagle-Session-Script exportieren</i></p>
			<blockquote>
				<p>Es wird eine Textdatei mit dem Namen des Designs und der Endung <i>.scr</i> geschrieben. Damit k&ouml;nnen Sie die &Auml;nderungen des Designs nach Cadsoft-Eagle importieren, indem Sie dort im Datei-Pulldown-Men&uuml;  <i>Script ausf&uuml;hren</i> w&auml;hlen und diese Textdatei einlesen. Nach dem Schreiben der Textdatei werden Sie gefragt, ob Sie die in diesem Programm erzeugten Regeln zur sp&auml;teren Wiederverwendung speichern m&ouml;chten. Antworten Sie mit Ja, wenn Sie z. B. Via-Regeln definiert haben, die Sie nach dem Hin- und Herwechseln nach Eagle und wieder zur&uuml;ck wieder verwenden wollen. Dabei k&ouml;nnen allerdings in Eagle neu definierte Regeln unter Umst&auml;nden &uuml;berschrieben werden.</p>
				<p></p>
				<p></p>
			</blockquote>
		</blockquote>
	</body>

</html>