<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Adobe GoLive 6">
		<title>Snapshots</title>
	</head>

	<body bgcolor="#ffffff">
		<h3>Snapshots</h3>
		<p>Im Snapshots-Fenster k&ouml;nnen Sie den aktuellen interaktiven Zustand des Programms abspeichern, um ihn sp&auml;ter bei Bedarf  wiederherzustellen.</p>
		<h4>Beschreibung der Buttons:</h4>
		<blockquote>
			<p><i>Gehe zu ausgew&auml;hltem Snapshot</i></p>
			<blockquote>
				<p>Stellt den Interaktiven Zustand wieder her, der in dem ausgew&auml;hlten Snapshot abgespeichert ist. Alternativ k&ouml;nnen Sie einen Snapshot in der Liste doppelklicken. </p>
				<p>Um st&auml;ndigesWechseln zwischen dem Hauptfenster und dem Snapshot-Fenster zu vermeiden, k&ouml;nnen Sie statt dessen auch die <i>j</i>-Taste dr&uuml;cken.  Mit der <i>h</i>-Taste k&ouml;nnen Sie den vorherigen und mit der <i>k</i>-Taste den  n&auml;chsten Snapshot selektieren.</p>
			</blockquote>
			<p><i>Neuer Snapshot</i></p>
			<blockquote>
				<p>Hier k&ouml;nnen Sie den aktuellen interaktiven Zustand in einem neuen Snapshot abspeichern, nachdem Sie den voreingestellten Namen in einen aussagekr&auml;ftigeren Namen umge&auml;ndert haben.</p>
			</blockquote>
			<p><i>Ausgew&auml;hlten Snapshot l&ouml;schen</i></p>
			<blockquote>
				<p>L&ouml;scht den mit der linken Maustaste ausgew&auml;hlten Snapshot.</p>
			</blockquote>
			<p><i>Alle Snapshots l&ouml;schen</i></p>
			<blockquote>
				<p>Entfernt alle Snapshots aus der Liste.</p>
			</blockquote>
			<p><i>Snapshot-Einstellungen</i></p>
			<blockquote>
				<p>&Ouml;ffnet  ein Fenster mit den <a href="#Snapshot-Einstellungen">Snapshot-Einstellungen</a>. Dort k&ouml;nnen Sie die Attribute abw&auml;hlen,  die nicht mit abgespeichert werden sollen.</p>
			</blockquote>
		</blockquote>
		<h4><a name="SnapshotSettings"></a>Beschreibung der Felder im Fenster mit den Snapshot-Einstellungen:</h4>
		<blockquote>
			<i>Objekt-Farben</i>
			<blockquote>
				<p>Die aktuellen Farbeinstellungen f&uuml;r die Objekttypen werden mit abgespeichert.</p>
			</blockquote>
			<p><i>Objekt-Sichtbarkeit</i></p>
			<blockquote>
				<p>Die aktuell eingestellte Intensit&auml;t f&uuml;r die Abbildung der einzelnen Objekttypen wird mit abgespeichert.</p>
			</blockquote>
			<p><i>Lagen-Sichtbarkeit</i></p>
			<blockquote>
				<p>Die aktuell eingestellte Intensit&auml;t f&uuml;r die Abbildung der Objekttypen auf den einzelnen Lagen wird mit abgespeichert.</p>
			</blockquote>
			<p><i>Abbildungs-Ausschnitt</i></p>
			<blockquote>
				<p>Der zurzeit abgebildete Ausschnitt der Platine wird mit abgespeichert.</p>
			</blockquote>
			<p><i>interaktiver Zustand</i></p>
			<blockquote>
				<p>Es wird mit abgespeichert, ob sich das Programm zurzeit im Select- Route- oder Drag-Zustand befindet.</p>
			</blockquote>
			<p><i>Selektions-Lagen</i></p>
			<blockquote>
				<p>Es wird mit abgespeichert, ob im Fenster mit den Select-Einstellungen die <i>Selektions-Lagen</i> auf <i>alle sichtbaren</i> oder auf<i> nur aktuelle</i> geschaltet sind.</p>
			</blockquote>
			<p><i>selektierbare Objekte</i></p>
			<blockquote>
				<p>Die im Fenster mit den Select-Einstellungen unter <i>Selektierbare Objekte </i>eingestellten Werte werden mit abgespeichert.</p>
			</blockquote>
			<p><i>aktuelle Lage</i></p>
			<blockquote>
				<p>Die im Fenster mit den Select-Einstellungen  unter <i>Aktuelle-Lage</i> eingestellte Lage wird mit abgespeichert.</p>
			</blockquote>
			<p><i>Regel-Auswahl</i></p>
			<blockquote>
				<p>Es wird mit abgespeichert, ob im Fenster mit den Route-Einstellungen die <i>Regel-Auswahl </i>auf <i>automatisch</i> oder <i>manuell</i> eingestellt ist.</p>
			</blockquote>
			<p><i>manuelle Regel-Einstellungen</i></p>
			<blockquote>
				<p>Die Einstellungen im Fenster mit den manuellen Regeln werden mit abgespeichert.</p>
			</blockquote>
			<p><i>schieben erlaub</i>t</p>
			<blockquote>
				<p>Es wird mit abgespeichert, ob im Fenster mit den Route-Einstellungen  <i>schieben erlaubt</i> angew&auml;hlt ist.</p>
			</blockquote>
			<p><i>Bauteil-Ziehen erlaubt</i></p>
			<blockquote>
				<p>Es wird mit abgespeichert, ob im Fenster mit den Route-Einstellungen <i>Bauteil-Ziehen erlaubt</i> angew&auml;hlt ist.</p>
			</blockquote>
			<p><i>Glattzieh-Bereich</i></p>
			<blockquote>
				<p>Der im Fenster mit den Route-Einstellungen eingestellte Wert f&uuml;r den <i>Glattzieh-Bereich</i> beim Routen wird mit abgespeichert.</p>
			</blockquote>
			<p><i>Bauteil-Raster</i></p>
			<blockquote>
				<p>Der im Fenster mit den Platzierungs-Parametern eingestellte Wert f&uuml;r das <i>Bauteil-Raster</i> beim     Verschieben von Bauteilen wird mit abgespeichert.</p>
			</blockquote>
			<p><i>Info-Listen-Selektion</i></p>
			<blockquote>
				<p>Die selektierten Indizes und die Filter-Strings in den Fenstern o<i>ffene Verbindungen,  Bibliotheks-Packages,  Bibliotheks-Padstacks, platzierte Bauteile </i>und<i>  Netze  </i>werden mit abgespeichert.</p>
				<blockquote>
					<blockquote>
						<blockquote>
							<blockquote>
								<p></p>
							</blockquote>
						</blockquote>
					</blockquote>
				</blockquote>
				<p></p>
				<p></p>
				<p></p>
			</blockquote>
		</blockquote>
	</body>

</html>