<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Adobe GoLive 6">
		<title>Route-Einstellungen</title>
	</head>

	<body bgcolor="#ffffff">
		<h3>Route-Einstellungen</h3>
		Beschreibung des Fensters mit den Route-Einstellungen
		<h4><a name="AngleRestriction"></a>Winkel-Einschr&auml;nkung:</h4>
		<blockquote>
			90 Grad:
			<blockquote>
				<p>Beim interaktiven Routen entstehen nur horizontale und vertikale Bahnen.</p>
			</blockquote>
			<p>45 Grad:</p>
			<blockquote>
				<p>Die Winkel der beim interaktiven Routen entstehenden Bahnen sind auf vielfache von 45 Grad beschr&auml;nkt.</p>
			</blockquote>
			<p>keine:</p>
			<blockquote>
				<p>Es gibt keine Winkelbeschr&auml;nkungen beim interaktiven Routen.</p>
			</blockquote>
		</blockquote>
		<h4><a name="RoutingMode"></a>Route-Modus:</h4>
		<blockquote>
			dynamisch:
			<blockquote>
				<p>Bahn wird eingef&uuml;gt bei jeder Bewegung des Cursors.</p>
			</blockquote>
			<p>stitching:</p>
			<blockquote>
				<p>Bahn wird eingef&uuml;gt beim Klicken der linken Maustaste.</p>
			</blockquote>
		</blockquote>
		<h4><a name="RuleSelection"></a>Regel-Auswahl:</h4>
		<blockquote>
			automatisch:
			<blockquote>
				<p>Die beim Routen verwendeten Regeln werden durch die <a href="WindowNetClasses.html">Netzklasse</a> des zu routenden Netz bestimmt.</p>
			</blockquote>
			<p>manuell:</p>
			<blockquote>
				<p>Die beim Routen verwendeten Regeln werden im Fenster<i> <a href="WindowManualRules.html">Manuelle Regeln</a> </i>festgelegt. Das Fenster &ouml;ffnet sich automatisch beim Anw&auml;hlen von <i>manuell.</i></p>
			</blockquote>
		</blockquote>
		<h4>schieben erlaubt</h4>
		<blockquote>
			Hier k&ouml;nnen sie einstellen, ob fremde Bahnen beim Routen verschoben werden d&uuml;rfen.</blockquote>
		<h4>ziehen von Bauteilen erlaubt</h4>
		<blockquote>Hier k&ouml;nnen Sie einstellen, ob Bauteile mit gedr&uuml;ckter linker Maustaste gezogen werden d&uuml;rfen. Die schon   gerouteten Verbindungen des entsprechenden Bauteils werden automatisch mitgezogen.</blockquote>
		<h4>Vias schnappen zum SMD-Zentrum</h4>
		<blockquote>
			Stellen Sie hier ein, ob Vias, f&uuml;r die Bohren auf SMD-Pins erlaubt ist, in diesem Fall automatisch zum Zentrum des Pins schnappen sollen.</blockquote>
		<h4>Highlight Route-Hindernis</h4>
		<blockquote>Wenn eingeschaltet, wird das Objekt gehighlighted, das ein Weiterrouten verhindert.</blockquote>
		<h4>Leitungsfl&auml;chen ignorieren</h4>
		<blockquote>
			Wenn eingeschaltet, werden Leitungsfl&auml;chen (z. B. Kupferfl&auml;chen) von fremden Netzen  nicht als Hindernis betrachtet. Damit k&ouml;nnen sie z.B. im Hostsystem automatisch ausgespart werden.</blockquote>
		<h4><a name="Neckdown"></a>automatisches Neckdown</h4>
		<blockquote>
			Wenn eingeschaltet, wird beim Starten oder Anschlie&szlig;en an Pins,  die schmaler als die beim Routen verwendete Bahnbreite sind und dadurch ein Weiterrouten verhindern, die Bahnbreite automatisch auf die Pinbreite reduziert.</blockquote>
		<h4><a name="ExitDirections"></a>Exit-Richtungen bei Pins einschr&auml;nken</h4>
		<blockquote>
			Hier k&ouml;nnen Sie festlegen, ob bei l&auml;nglichen Pins Bahnen nur an den Schmalseiten angeschlossen werden d&uuml;rfen.</blockquote>
		<h4>Pad-Abbiege-Abstand</h4>
		<blockquote>
			Geben Sie hier den Mindestabstand vom Pad-Rand der Pins mit Exitbeschr&auml;nkungen an,  ab denen Bahnen die Richtung &auml;ndern d&uuml;rfen.</blockquote>
		<h4><a name="PullTightRegion"></a>Glattzieh-Bereich</h4>
		<blockquote>Hier k&ouml;nnen Sie den Bereich um den Cursor einschr&auml;nken, in dem die Bahnen beim Routen glatt gezogen werden. Bei 0 ist das Glattziehen vollst&auml;ndig abgeschaltet, bei 999 gibt es keine Einschr&auml;nkung des Glattziehbereichs. Ein Wert von 0 ist nur sinnvoll, wenn der Route-Modus auf <i>stitching</i> geschaltet ist.</blockquote>
		<p><a href="RouteState.html">back</a></p>
	</body>

</html>