<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Adobe GoLive 6">
		<title>Move-Zustand</title>
	</head>

	<body bgcolor="#ffffff">
		<h3>Der Move-Zustand</h3>
		Hierher gelangen Sie, nachdem Sie in <a href="SelectedItemState.html">Auswahl-Zustand</a>  im Popup-Men&uuml; <i>verschieben</i> gew&auml;hlt haben. Die selektierten Objekte folgen jetzt dem Cursor.
		<p>Wenn Teile der sich bewegenden Objekte rot markiert sind, w&uuml;rde beim Einf&uuml;gen an dieser Stelle eine Clearance-Verletzung entstehen.</p>
		<p>Es k&ouml;nnen mehrere Bauteile gleichzeitig verschoben werden. Der interne Route wird mitgenommen, insofern er komplett zum Verschieben markiert ist. Bauteile k&ouml;nnen nicht verschoben werden, wenn sie mit Objekten verbunden sind, die nicht zum Verschieben markiert sind. Solche Bauteile k&ouml;nnen Sie evtl. im  <a href="MenuState.html#DragMenuState">Drag-Men&uuml;-Zustand </a>durch Ziehen mit der linken Maustaste bewegen. Ansonsten m&uuml;ssen Sie vorher den Route entfernen.</p>
		<p>Es werden die Einstellungen im Fenster mit den <a href="WindowMoveParameter.html">Platzierungs-Parametern</a> ausgewertet.</p>
		<h4>Die Eintr&auml;ge im Popup-Men&uuml; unter der rechten Maustaste:</h4>
		<blockquote>
			<a name="Rotate"></a><i>drehen</i>
			<blockquote>
				<p>Hier k&ouml;nnen Sie die ausgew&auml;hlten Bauteile um vielfache von 45 Grad  um den Cursor drehen. F&uuml;r Drehungen um 90, 180, und -90 Grad gibt es die Shortcuts  +, * und - auf der Tastatur rechts vom Ziffernblock. Wenn Sie um einen Winkel drehen m&ouml;chten, der kein vielfaches von 45 Grad ist, k&ouml;nnen Sie das durch Drehen mit dem Mausrad, nachdem Sie im Fenster mit den <a href="WindowMoveParameter.html">Platzierungs-Parametern </a>die Funktion des Mausrads von <i>zoomen</i> auf <i>drehen</i> umgestellt haben.</p>
			</blockquote>
			<p><a name="ChangeSide"></a><i>Seite wechseln</i></p>
			<blockquote>
				<p>Hier k&ouml;nnen Sie die Platzierungsseite der ausgew&auml;hlten Bauteile wechseln. Shortcut ist /.</p>
			</blockquote>
			<p><i>Rotation zur&uuml;cksetzen</i></p>
			<blockquote>
				<p>Hier k&ouml;nnen Sie die Rotation der selektierten Bauteile auf 0 Grad zur&uuml;cksetzen, nachdem Sie sie vorher durch Drehen mit dem Mausrad ver&auml;ndert hatten.</p>
			</blockquote>
			<p><a name="Insert"></a><i>einf&uuml;gen</i></p>
			<blockquote>
				<p>Zum Einf&uuml;gen der am Cursor h&auml;ngenden Bauteile. Wenn dabei Clearance-Verletzungen entstehen w&uuml;rden, wird das Einf&uuml;gen verweigert. Shortcut ist die linke Maustaste.</p>
			</blockquote>
			<p><i>abbrechen</i></p>
			<blockquote>
				<p>Zum Abrechen der Verschiebe-Aktion. Die selektierten Bauteile springen an ihren Ausgangspunkt zur&uuml;ck. Shortcut ist die Esc-Taste.</p>
			</blockquote>
		</blockquote>
		<p><a href="SelectedItemState.html#Move">zur&uuml;ck</a></p>
		<blockquote>
			<blockquote>
				<p></p>
			</blockquote>
		</blockquote>
	</body>

</html>