<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Adobe GoLive 6">
		<title>Die Objektlisten</title>
	</head>

	<body bgcolor="#ffffff">
		<h3>Die Objektlisten</h3>
		Hier werden die Fenster mit den Objektlisten dokumentiert, wie sie in der Men&uuml;leiste unter <i>Info</i> zu finden sind.  
		<p>Die Objekte in einer solchen Liste k&ouml;nnen mit der linken Maustaste selektiert werden. Wenn Sie die Strg- oder Ctrl-Taste dabei gedr&uuml;ckt halten, k&ouml;nnen Sie auch mehrere Objekte ausw&auml;hlen. Mit gedr&uuml;ckter Shift-Taste k&ouml;nnen Sie alle Objekte zwischen dem zuerst selektierten und dem zuletzt selektierten Objekt ausgew&auml;hlen.</p>
		<h4>Die Buttons im Objektlisten-Fenster:</h4>
		<blockquote>
			<p><i>Info</i></p>
			<blockquote>
				<p>&Ouml;ffnet ein Textfenster mit Informationen &uuml;ber die selektierten Objekte. &Uuml;ber die blau markierten Ausdr&uuml;cke in diesem Textfenster k&ouml;nnen Sie sich durch Klicken mit der linken Maustaste weitere Informationen besorgen.</p>
			</blockquote>
			<p><i>Anzeigen</i> </p>
			<blockquote>
				<p>Es wird ein Ausschnitt der Platine mit den ausgew&auml;hlten Objekten abgebildet. Die selektierten Objekte werden dabei gehighlighted. Danach befindet sich das Programm im <a href="SelectedItemState.html">Auswahlzustand</a>.</p>
			</blockquote>
			<p>Invertieren</p>
			<blockquote>
				<p>Selektierte Objekte in der Liste werden deselektiert und umgekehrt.</p>
			</blockquote>
			<p><i>Neu berechnen</i></p>
			<blockquote>
				<p>Die Objektliste wird neu berechnet.</p>
			</blockquote>
			<p><i>Filter</i></p>
			<blockquote>
				<p>Hier k&ouml;nnen Sie eine Zeichenfolge zum Filtern der Objekte in der Liste angeben. Wenn Sie danach auf <i>Neu berechnen</i> dr&uuml;cken, werden nur noch die Objekte ausgegeben, die diese Zeichenfolge enthalten.</p>
			</blockquote>
		</blockquote>
		<p>Es gibt Objektlisten f&uuml;r offene Verbindungen, L&auml;ngenverletzungen, Clearance-Verletzungen, Bibliotheks-Packages, Bibliotheks-Padstacks, platzierte Bauteile und Netze. Es folgt eine kurze Beschreibung dieser Listen.</p>
		<h4>Die einzelnen Objektlisten:</h4>
		<blockquote>
			<p><a name="ClearanceViolations"></a><i>Clearance-Verletzungen</i></p>
			<blockquote>
				<p>Es werden die Objektpaare ausgegeben, wo der f&uuml;r diese Objekte geltende Mindestabstand nicht eingehalten wurde. Durch Dr&uuml;cken des Buttons <i>Anzeigen</i> k&ouml;nnen diese auf der Platine leicht gefunden werden.</p>
			</blockquote>
			<p><a name="LibraryPackages"></a><i>Bibliotheks-Packages</i></p>
			<blockquote>
				<p>Es werden alle in der Bibliothek vorkommenden Packages ausgegeben. Nach Dr&uuml;cken des Buttons <i>Anzeigen</i> sehen Sie sich alle Bauteile auf der Platine, in denen die selektierten Packages verwendet werden.</p>
			</blockquote>
			<p><a name="LibraryPadstacks"></a><i>Bibliotheks-Padstacks</i></p>
			<blockquote>
				<p>Es werden alle in der Bibliothek vorkommenden Padstacks ausgegeben. Nach Dr&uuml;cken des Buttons <i>Anzeigen</i> sehen Sie sich alle Pins und Vias auf der Platine, in denen die selektierten Padstacks verwendet werden.</p>
			</blockquote>
			<p><a name="BoardComponents"></a><i>platzierte Bauteile</i></p>
			<blockquote>
				<p>Es werden alle auf der Platine platzierten Bauteile ausgegeben. Nach Dr&uuml;cken des Buttons <i>Anzeigen </i>sehen Sie sich die selektierten Bauteile auf der Platine.</p>
			</blockquote>
		</blockquote>
		<blockquote>
			<p><a name="Incompletes"></a><i>offene Verbindungen</i></p>
			<blockquote>
				<p>Es werden alle noch zu routenden offenen Verbindungen ausgegeben. Die Eintr&auml;ge enthalten den Netznamen gefolgt von Bauteil-Name und  Pin-Name  der beiden  End-Objekte der offenen Verbindung. Wenn es nur noch wenige offene Verbindungen gibt, k&ouml;nnen diese durch Dr&uuml;cken des Buttons <i>Anzeigen</i> auf der  Platine leicht gefunden werden.</p>
			</blockquote>
			<p><a name="LengthViolations"></a><i>L&auml;ngenverletzungen</i></p>
			<blockquote>
				<p>Es werden die gerouteten Verbindungen ausgegeben, bei denen die erlaubte Mindestl&auml;nge unterschritten oder die erlaubte Maximall&auml;nge &uuml;berschritten wurde. Bei Unterschreiten der Mindestl&auml;nge wird auf der Platine an den Endpunkten der Verbindung ein Kreis mit einem &quot;-&quot;  abgebildet, bei &Uuml;berschreiten der Maximall&auml;nge ein Kreis mit einem &quot;+&quot;. Die Gr&ouml;&szlig;e eines solchen Kreis entspricht der Gr&ouml;&szlig;e der L&auml;ngenverletzung.</p>
			</blockquote>
			<p><a name="ClearanceViolations"></a><i>Clearance-Verletzungen</i></p>
			<blockquote>
				<p>Es werden die Objektpaare ausgegeben, wo der f&uuml;r diese Objekte geltende Mindestabstand nicht eingehalten wurde. Durch Dr&uuml;cken des Buttons <i>Anzeigen</i> k&ouml;nnen diese auf der Platine leicht gefunden werden.</p>
			</blockquote>
			<p><a name="UnconnectedRoute"></a><i>nicht verbundener Route</i></p>
			<blockquote>
				<p>Es werden die elektrisch verbundenen Traces und Vias ausgegeben, die nicht an Pins oder Leitungsfl&auml;chen angeschlossen sind und somit in der Luft h&auml;ngen.. Durch Dr&uuml;cken des Buttons <i>Anzeigen</i> k&ouml;nnen die selektierten Objekte auf der Platine leicht gefunden werden. Anschlie&szlig;end k&ouml;nnen Sie diese durch Dr&uuml;cken des Buttons <i>L&ouml;schen</i> im Toolbar entfernen.</p>
			</blockquote>
			<p><a name="RouteStubs"></a><i>Route-Stumme</i>l</p>
			<blockquote>
				<p>Es werden Trace-Stummel und  und Vias mit nur einem Kontakt ausgegeben. Durch Dr&uuml;cken des Buttons <i>Anzeigen</i> k&ouml;nnen die selektierten Stummel auf der Platine leicht gefunden werden. Anschlie&szlig;end k&ouml;nnen Sie die Stummel durch Dr&uuml;cken des Buttons <i>Verb</i>. auf die dazugeh&ouml;rigen Verbindungen erweitern und diese dann durch Dr&uuml;cken des Buttons <i>L&ouml;schen</i> im Toolbar entfernen.</p>
			</blockquote>
			<p><a name="Nets"></a><i>Netze</i></p>
			<blockquote>
				<p>Es werden alle auf der Platine verwendeten Netze ausgegeben. Dieses Fenster enth&auml;lt zwei weitere Buttons. Mit dem Button <i>Klasse zuweisen</i> k&ouml;nnen Sie den ausgew&auml;hlten Netzen eine neue Netzklasse zuweisen. Nach Dr&uuml;cken des Button <i>Incompletes filtern</i> werden nur die Luftlinien der offenen Verbindungen abgebildet, die zu einem selektierten Netz geh&ouml;ren.</p>
			</blockquote>
			<p></p>
		</blockquote>
		<h3></h3>
		<h3></h3>
	</body>

</html>