<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Adobe GoLive 6">
		<title>Display-Einstellungen</title>
	</head>

	<body bgcolor="#ffffff">
		<h3>Display-Einstellungen</h3>
		Beschreibung der Fenster f&uuml;r die Display-Einstellungen. 
		<blockquote>
			<h4><a name="ObjectVisibility"></a>Objekt-Sichtbarkeit</h4>
			<blockquote>Mit den Schiebereglern in diesem Fenster k&ouml;nnen Sie die Intensit&auml;t einstellen, mit denen die einzelnen Objekttypen abgebildet werden. Die Werte gehen kontinuierlich von alles &uuml;berdeckender Sichtbarkeit ganz rechts bis zu v&ouml;lliger Unsichtbarkeit ganz links &uuml;ber. Es empfiehlt sich die Sichtbarkeit f&uuml;r Fl&auml;chen-Objekte (Leitungsfl&auml;chen, Sperrfl&auml;chen) nicht zu gro&szlig; einzustellen.</blockquote>
			<h4><a name="LayerVisibility"></a>Lagen-Sichtbarkeit</h4>
			<blockquote>
				<p>Mit diesen Schiebereglern k&ouml;nnen Sie f&uuml;r jede einzelne Lage einstellen, mit welcher Intensit&auml;t Objekte auf dieser Lage abgebildet werden sollen. Ziehen Sie einen  Schieberegler ganz links, werden die Objekte auf der entsprechenden Lage unsichtbar.</p>
			</blockquote>
			<h4><a name="Colors"></a>Farben</h4>
			<blockquote>
				<p>Hier k&ouml;nnen Sie die Farben festlegen, mit denen Objekte auf der Platine abgebildet werden, indem Sie mit der linken Maustaste auf das entsprechende Farbfeld klicken. F&uuml;r die Objekttypen in der oberen Tabelle kann die Farbe f&uuml;r jede Lage einzeln eingestellt werden.</p>
			</blockquote>
			<h4><a name="Miscellanious"></a>sonstiges</h4>
			<blockquote>
				<p><i>Crosshair-Cursor</i></p>
				<blockquote>
					<p>Hier k&ouml;nnen Sie vom normalen kleinem Crosshair-Cursor zu einem gro&szlig;en 45-Grad Crosshair-Cursor umschalten. Das Verwenden des gro&szlig;en Crosshair-Cursors kann die Display-Performance erheblich beeintr&auml;chtigen. Shortcut ist die Komma-Taste.</p>
				</blockquote>
				<p><a name="BoardRotation"></a><i>Platinenrotation</i></p>
				<blockquote>
					<p>Hier k&ouml;nnen Sie die Platine um vielfache von 90 Grad drehen.</p>
				</blockquote>
				<p><a name="BoardMirroring"></a><i>Platinenspiegelung</i></p>
				<blockquote>
					<p>Hier k&ouml;nnen Sie die Platine an der horizontalen oder vertikalen Achse spiegeln.</p>
				</blockquote>
				<p><a name="AutomaticLayerDimming"></a><i>automatisches Lagen-Dimmen</i></p>
				<blockquote>
					<p>mit dem Schieberegler k&ouml;nnen Sie einstellen, wie stark Objekte auf der in den <a href="WindowSelectParameter.html">Select-Einstellungen</a> beschriebenen aktuellen Lage hervorgehoben werden sollen. Wenn Sie den Regler ganz nach links schieben, wird das automatische Lagen-Dimmen komplett abgeschaltet, schieben Sie ihn ganz nach rechts, werden alle Lagen bis auf die aktuelle Lage unsichtbar.</p>
				</blockquote>
				<p></p>
			</blockquote>
		</blockquote>
	</body>

</html>