<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Adobe GoLive 6">
		<title>Men&uuml;-Zustand</title>
	</head>

	<body bgcolor="#ffffff">
		<h3>Die Men&uuml;-Zust&auml;nde</h3>
		Das Programm hat die folgenden drei Men&uuml;-Zust&auml;nde: <i><a href="#SelectMenuState">Selektieren</a>, <a href="#RouteMenuState">Routen</a></i> und <i><a href="#DragMenuState">Ziehen</a></i>. Durch Selektieren eines der drei Buttons links oben auf dem Toolbar k&ouml;nnen Sie zwischen diesen Zust&auml;nden hin- und herschalten. Am Anfang befindet sich das Programm im Select-Men&uuml;-Zustand.
		<p>Allen drei Zust&auml;nden sind der Toolbar und das Popup-Men&uuml; unter der rechten Maustaste gemeinsam.</p>
		<h4>Die weiteren Toolbar-Eintr&auml;ge:</h4>
		<blockquote>
			<a name="Autorouter"></a><i>Autorouter</i>
			<blockquote>
				<p>Den Batch-Autorouter auf dem gesamten Board aufrufen.</p>
			</blockquote>
		</blockquote>
		<blockquote>
			<a name="Undo"></a><i>Undo, Redo</i>
			<blockquote>
				<p>Das Programm hat unbegrenzte Undo-Redo-F&auml;higkeiten. In der Offline-Version geht der Undo-Stack selbst nach Speichern des Designs und Neustart des Programms nicht verloren. Shortcuts sind <i>u</i>  f&uuml;r Undo und <i>b</i> f&uuml;r Redo</p>
			</blockquote>
			<p><a name="Incompletes"></a><i>Incompletes</i></p>
			<blockquote>
				<p>Hier k&ouml;nnen Sie das Zeigen der offenen Verbindungen als Luftlinien ein- oder ausschalten. Wenn die Luftlinien vorher ausgeschaltet waren, werden sie eingeschaltet und umgekehrt. Shortcut ist<i> g</i>.</p>
			</blockquote>
			<p><a name="Violations"></a><i>Verletzungen</i></p>
			<blockquote>
				<p>Hier k&ouml;nnen Sie das Zeigen der Abstandsverletzungen an- oder abschalten. Wenn die Abstandsverletzungen vorher abgeschaltet waren, werden sie eingeschaltet und umgekehrt. Shortcut ist <i>v</i>.</p>
			</blockquote>
			<p><i>Alles  abbilden</i></p>
			<blockquote>
				<p>Zum Abbilden der gesamten Platine. Shortcut ist <i>a</i>.</p>
			</blockquote>
			<p><a name="DisplayRegion"></a><i>Ausschnitt abbilden</i></p>
			<blockquote>
				<p>Nachdem Sie diesen Eintrag angew&auml;hlt haben, k&ouml;nnen Sie durch Ziehen der Maus mit gedr&uuml;ckter linker Maustaste ein abzubildendes Rechteck ausw&auml;hlen. Shortcut ist <i>f. </i>Zoomen k&ouml;nnen Sie auch durch Drehen des Mausrads und Pannen durch Ziehen der Maus mit gedr&uuml;cktem Mausrad.</p>
			</blockquote>
			<p><a name="Unit"></a>Unit</p>
			<blockquote>
				<p>Hier kann die Ma&szlig;einheit und der Ma&szlig;einheits-Faktor eingestellt werden. Sie k&ouml;nnen ausw&auml;hlen zwischen <i>mil</i>, <i>inch, mm</i> und <i>um. </i>Wenn Sie z. B. 0.1<i> mm </i>einstellen<i>,  </i>werden alle Koordinaten auf der Benutzeroberfl&auml;che als vielfache von 0,1 mm angezeigt.</p>
			</blockquote>
		</blockquote>
		<h4>Die Popup-Men&uuml;-Eintr&auml;ge:</h4>
		<blockquote>
			<a name="select_object"></a><i>Objekt selektieren</i>
			<blockquote>
				<p>Zum Selektieren von Objekten unter dem Cursor. Dabei werden die Einstellungen aus dem Fenster <a href="WindowSelectParameter.html">Select-Einstellungen</a> ausgewertet. Wurden Objekte zum Ausw&auml;hlen gefunden, befindet sich das Programm danach im <a href="SelectedItemState.html">Auswahl-Zustand</a>. Im <a href="#SelectMenuState">Select-Men&uuml;-Zustand</a> k&ouml;nne Sie auch mit der linken Maustaste Objekte selektieren.</p>
			</blockquote>
			<a name="start_route"></a><i>Route starten</i>
			<blockquote>Vom Objekt unter dem Mauszeiger aus wird eine neue Bahn begonnen. Dabei werden die Einstellungen aus dem Fenster <a href="WindowSelectParameter.html">Select-Einstellungen</a> ausgewertet. Wurde ein geeignetes Objekt gefunden, befindet sich das Programm danach im<a href="RouteState.html"> Route-Zustand</a>. Im <a href="#RouteMenuState">Route-Men&uuml;-Zustand</a> reicht dazu das Klicken mit der linken Maustaste,</blockquote>
			<a name="CreateKeepout"></a><i>Sperrfl&auml;che konstruieren</i>
			<blockquote>Hiermit k&ouml;nnen Sie auf der aktuellen Lage eine Sperrfl&auml;che konstruieren. Dabei kann es sich um einen Kreis, ein Polygon, oder um ein Loch in einer existierenden polygonalen Sperrfl&auml;che handeln.</blockquote>
			<a name="Pinswap"></a><i>Pin tauschen</i>
			<blockquote>Dieser Men&uuml;-Eintrag erscheint nur, wenn es auf der Platine tauschbare Pins gibt. Ist der Pin unter dem Cursor tauschbar, k&ouml;nnen Sie hier die Netz-Zugeh&ouml;rigkeit dieses Pins mit einem anderen Pin tauschen.</blockquote>
			<p>Die Zeichen in Klammern hinter den  Popup-Men&uuml;-Eintr&auml;gen bezeichnen die Shortcuts f&uuml;r die entsprechenden Aktionen.</p>
		</blockquote>
		<h4>Die Funktion des Mausrad:</h4>
		<blockquote>
			<p><a name="MouseWheel"></a>Durch Drehen mit dem Mausrad k&ouml;nnen Sie den abgebildeten Ausschnitt der Platine vergr&ouml;&szlig;ern oder verkleinern, und durch Ziehen der Maus mit gedr&uuml;cktem Mausrad k&ouml;nnen Sie das abgebildete Rechteck verschieben.</p>
			<p></p>
		</blockquote>
		<h4><a name="SelectMenuState"></a></h4>
		<h3>Der Selektions-Men&uuml;-Zustand</h3>
		
		Ist oben links auf der Werkzeugleiste der Button <i>Selektieren</i> angew&auml;hlt, befindet sich das Programm im Selektions-Men&uuml;-Zustand. Die linke Maustaste dient hier als Shortcut f&uuml;r die Aktion <i>Objekt selektieren</i> im Popup-Men&uuml;. Au&szlig;er dem k&ouml;nnen Sie durch Ziehen der Maus mit gedr&uuml;ckter linker Taste alle Objekte in einem Rechteck selektieren.	
		
		<p><a href="MenuState.html">zur&uuml;ck</a></p>
		<h4><a name="RouteMenuState"></a></h4>
		<h3>Der Route-Men&uuml;-Zustand</h3>
		
		Ist oben links auf der Werkzeugleiste der Button <i>Routen</i> angew&auml;hlt, befindet sich das Programm im Route-Men&uuml;-Zustand. Die linke Maustaste dient hier als Shortcut f&uuml;r die Aktion <i>Route starten</i> im Popup-Men&uuml;. 
		
		<p><a href="MenuState.html">zur&uuml;ck</a></p>
		<h4><a name="DragMenuState"></a></h4>
		<h3>Der Zieh-Men&uuml;-Zustand</h3>
		
		Ist oben links auf der Werkzeugleiste der Button <i>Ziehen</i> angew&auml;hlt, befindet sich das Programm im Zieh-Men&uuml;-Zustand. Hier k&ouml;nnen Sie mit gedr&uuml;ckter linker Maustaste Vias oder Bauteile ziehen und so ihre Position ver&auml;ndern. Dabei werden die angeschlossenen Bahnen automatisch mit ver&auml;ndert. Weiter k&ouml;nnen Sie mit gedr&uuml;ckter linker Maustaste aus dem leeren Raum heraus Bahnen beiseite schieben und sich so Platz schaffen z. B. f&uuml;r das Einf&uuml;gen eines weiteren Bauteils. Diese Aktion wird auf der <i>Aktuellen Lage </i>ausgef&uuml;hrt, die im Fenster mit den <a href="WindowSelectParameter.html">Select-Einstellungen </a>eingestellt werden kann.
	
		<p><a href="MenuState.html">zur&uuml;ck</a></p>
	</body>

</html>