<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<meta name="generator" content="Adobe GoLive 6">
		<title>Auswahl-Zustand</title>
	</head>

	<body bgcolor="#ffffff">
		<h3>Der Auswahl-Zustand</h3>
		Nachdem Sie im Grundzustand <a href="MenuState.html#SelectObject">Objekte selektiert</a> haben, befindet sich das Programm im Auswahl-Zustand. Die selektierten Objekte werden gehighlightet und es erscheint am oberen Rand ein neuer Toolbar. Mit der linken Maustaste k&ouml;nnen Sie weitere Objekte selektieren oder schon selektierte Objekte wieder abw&auml;hlen.		<h4>Der Toolbar im Auswahl-Zustand</h4>
		<blockquote>
			<i>Abbrechen</i>
			<blockquote>
				<p>Das Programm kehrt in den interaktiven Zustand vor dem Selektieren zur&uuml;ck. Shortcut ist die <i>Esc</i>-Taste.</p>
			</blockquote>
			<p><a name="Info"></a><i>Info</i></p>
			<blockquote>
				<p>In einem Fenster werden Informationen &uuml;ber die selektierten Objekte ausgegeben. &Uuml;ber die dort blau markierten Begriffe k&ouml;nnen Sie sich durch Klicken mit der linken Maustaste weitere Informationen besorgen. Shortcut ist <i>i</i>.</p>
			</blockquote>
			<p><a name="Delete"></a><i>L&ouml;schen</i></p>
			<blockquote>
				<p>Die markierten Objekte werden gel&ouml;scht, sofern sie nicht gefixt sind. Shortcut ist die <i>Entf</i>-Taste.</p>
			</blockquote>
			<p><a name="Cutout"></a><i>Ausschneiden</i></p>
			<blockquote>
				<p>Durch Ziehen der Maus mit gedr&uuml;ckter linker Taste k&ouml;nnen Sie ein Rechteck definieren, aus dem die selektierten Bahnen und Vias ausgeschnitten werden. Shortcut ist <i>d</i>.</p>
			</blockquote>
			<p><a name="Fix"></a><i>Fix</i></p>
			<blockquote>
				<p>Die selektierten Objekte fixieren, so dass sie nicht mehr verschoben oder gel&ouml;scht werden k&ouml;nnen. Shortcut ist  <i>f</i>.</p>
			</blockquote>
			<p><a name="Unfix"></a><i>Unfix</i></p>
			<blockquote>
				<p>Die Fixierung  der selektierten Objekte aufheben. Shortcut ist <i>u</i>.</p>
			</blockquote>
			<p><a name="Autoroute"></a><i>Autoroute</i></p>
            <blockquote>
				<p>Die selektierten Objekte automatisch routen. Shortcut ist <i>a</i>.</p>
            </blockquote>
				<p><a name="PullTight"></a><i>Gl&auml;tten</i></p>
				<blockquote>
				<p>Die selektierten Bahnen glatt ziehen. Shortcut ist <i>p</i>.</p>
			</blockquote>
			<p><a name="Fanout"></a><i>Fanout</i></p>
			<blockquote>
				<p>Die selektierten SMD-Pins automatisch bis zum ersten Via routen.</p>
			</blockquote>
			<p><a name="Clearance"></a><i>Clearance</i></p>
			<blockquote>
				<p>Den selektierten Objekten eine neue <a href="WindowClearanceMatrix.html">Clearance-Klasse</a> zuweisen.</p>
				<p>Beispiel: Wenn Sie in einem bestimmten Bereich der Platine einen gr&ouml;&szlig;eren Mindestabstand brauchen, k&ouml;nnen Sie alle Pins in einem Rechteck selektieren und ihnen eine neue Clearance-Klasse zuweisen.</p>
			</blockquote>
			<p><a name="Nets"></a><i>Netze</i></p>
			<blockquote>
				<p>Die Auswahl auf alle selektierbaren Objekte ausdehnen, die das gleiche Netz wie ein schon ausgew&auml;hltes Objekt haben. Shortcut ist <i>n</i>.</p>
			</blockquote>
			<p><a name="ConnectedSets"></a><i>Zush.</i></p>
			<blockquote>
				<p>Die Auswahl auf alle selektierbaren Objekte ausdehnen, die mit einem schon ausgew&auml;hlten Objekt elektrisch verbunden sind. Shortcut ist <i>s</i>.</p>
			</blockquote>
			<p><a name="Connections"></a><i>Verb</i>.</p>
			<blockquote>
				<p>Die Auswahl auf alle Bahnen und Vias ausdehnen, die zur gleichen Verbindung wie ein schon ausgew&auml;hlten Objekts geh&ouml;ren. Shortcut ist <i>e.</i></p>
				<p>Beispiel: Sie m&ouml;chten eine komplette Verbindung l&ouml;schen. Selektieren Sie eine Bahn der Verbindung. Dr&uuml;cken Sie zuerst auf den Button <i>Verb</i>. um die Auswahl auf die ganze Verbindung auszudehnen, und dann auf den Button <i>L&ouml;schen</i>.</p>
			</blockquote>
			<p><a name="Components"></a><i>Bauteile</i></p>
			<blockquote>
				<p>Die Auswahl auf alle selektierbaren Objekte ausdehnen, die zum gleichen Bauteil wie ein schon ausgew&auml;hltes Objekt geh&ouml;ren. Shortcut ist <i>b</i>.</p>
			</blockquote>
			<p><a name="Violations"></a><i>Verletzungen</i></p>
			<blockquote>
				<p>Hier k&ouml;nnen Sie das Zeigen der Abstandsverletzungen der selektierten Objekte an- oder abschalten. Wenn die Abstandsverletzungen vorher abgeschaltet waren, werden sie eingeschaltet und umgekehrt. Shortcut ist <i>v</i>.</p>
			</blockquote>
			<p><a name="ZoomSelection"></a><i>Auswahl abbilden</i></p>
			<blockquote>
				<p>Bildet ein umgebendes Rechteck um alle selektierten Objekte ab.</p>
			</blockquote>
		</blockquote>
		<h4>Das Popup-Men&uuml; unter der rechten Maustaste </h4>
		<blockquote>
			<a name="Move"></a><i>verschieben</i>
			<blockquote>Hier werden die selektierten Objekte zum Verschieben vorbereitet. Der Dreh- und Angelpunkt beim Verschieben ist die aktuelle Cursor-Position. Es k&ouml;nnen mehrere Bauteile gleichzeitig verschoben werden. Nach dieser Aktion befindet sich das Programm im <a href="MoveItemState.html">Move-Zustand</a>. Shortcut is <i>m</i>.</blockquote>
		</blockquote>
		<p><a href="MenuState.html#SelectMenuState">zur&uuml;ck</a></p>
		<blockquote>
			<p></p>
		</blockquote>
	</body>

</html>